Last login: Thu Aug  8 02:34:44 on ttys008
h-MBP-sl-Gilad:~ GiladanoN$ ssh -lcolman 193.106.55.89 -p 2289
colman@193.106.55.89's password: 
Welcome to Ubuntu 16.04.4 LTS (GNU/Linux 4.4.0-116-generic ppc64le)

 * Documentation:  https://help.ubuntu.com
 * Management:     https://landscape.canonical.com
 * Support:        https://ubuntu.com/advantage
New release '18.04.2 LTS' available.
Run 'do-release-upgrade' to upgrade to it.

Last login: Thu Aug  8 00:19:51 2019 from 213.57.185.155
colman@ubuntu:~$ cd gilad_gil/iEEEHighScore/
colman@ubuntu:~/gilad_gil/iEEEHighScore$ swipl rules.pl 
Welcome to SWI-Prolog (threaded, 64 bits, version 8.1.10-59-g09a7d55)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

    CMake built from "/home/colman/gilad_gil/swipl-devel/build"

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- set_prolog_flag(answer_write_options,[max_depth(0)]).
true.

?- runMain_N3([32|R],220).
R = [64,4,1,2,8,16,32,4,1,2,8,128,16,4,1,2,64,128,8,4,1,32,64,16,2,4,8,256,1,16,2,4,512,8,1,16,2,64,128,4,32,1,2,256,8,64,4,1,16,128,32,2,4,8,64,512,1,2,4,128,256,8,1,2,512,32,4,8,1,256,512,16,2,4,32,256,8,16,1,64,32,128,2,8,16,64,32,4,128,8,16,64,1,512,2,32,16,8,256,64,2,32,1,8,128,16,256,2,1,32,128,512,4,2,16,64,256,1,4,32,16,512,8,1,128,32,64,256,2,4,128,512,8,1,64,32,256,16,2,128,64,32,512,1,4,256,2,64,512,1,128,4,16,256,8,64,128,2,512,16,8,64,32,128,256,4,1,64,512,16,32,4,128,256,2,16,512,32,64,128,256,16,1,32,512,128,256,2,8,32,512,64,4,128,8,256,32,16,512,128,8,64,256,1,512,16,128,64,256,4,512,32,8,128,256,1,512,2,32].

?- runMain_N3([32|R],230).
R = [16,2,1,4,8,32,16,2,1,64,4,8,16,2,128,1,4,8,16,256,2,1,4,8,512,16,2,1,32,128,4,8,2,64,32,1,4,8,256,64,2,1,4,128,256,8,2,1,32,128,64,4,2,16,32,128,8,1,64,2,16,128,8,256,1,32,16,4,64,8,128,1,16,512,2,4,32,1,256,64,2,16,4,512,128,1,2,32,256,16,4,8,64,512,1,2,16,256,128,4,1,32,16,512,8,2,64,32,16,128,1,256,64,2,512,4,1,256,16,64,8,32,1,256,512,2,8,4,32,256,64,2,8,128,32,256,4,2,512,128,8,1,64,256,512,4,8,16,32,128,64,4,8,512,32,1,64,16,256,512,2,32,64,16,256,4,128,8,512,1,256,4,128,64,2,512,8,256,16,32,2,128,512,8,16,64,256,2,128,32,512,4,1,64,16,128,512,4,32,64,256,128,1,512,32,16,256,128,4,512,32,8,256,128,64,512,32,16,8,128,256,64,4,512,16,32,256,64,128].

?- runMain_N3([32|R],235).
R = [4,64,1,2,8,16,4,32,1,2,8,16,128,4,1,2,8,256,16,4,1,2,64,128,8,4,1,32,64,16,2,4,8,512,1,16,2,32,128,4,1,16,64,8,32,2,1,128,64,16,8,2,256,32,1,4,8,512,64,2,1,4,256,128,8,2,1,512,32,4,16,2,256,64,1,8,16,512,32,2,64,1,256,128,4,16,2,64,512,1,128,4,32,64,2,8,128,256,16,1,2,512,4,128,8,16,32,1,256,2,128,512,4,16,1,64,256,32,4,2,8,512,256,1,16,32,128,64,2,256,4,512,1,8,128,32,64,4,16,8,128,256,32,1,4,512,64,256,8,1,32,512,64,16,4,8,256,32,64,2,512,4,128,32,8,2,256,512,16,4,32,128,256,2,16,64,512,8,32,2,128,16,512,1,64,256,32,128,4,512,64,8,32,256,16,512,128,4,64,256,8,1,128,512,64,32,16,256,2,512,128,64,16,256,4,512,8,32,16,128,64,256,8,512,16,128,1,256,64,512,2,8,128,16].

?- runMain_N3([32|R],238).
R = [64,128,1,2,4,8,16,32,1,2,4,8,64,16,1,2,4,128,32,8,1,2,64,128,16,4,1,8,256,2,16,4,1,512,8,2,16,4,128,32,1,64,8,4,128,2,256,1,8,32,4,512,2,1,64,8,256,4,2,32,1,64,16,4,256,2,32,64,1,512,4,8,128,16,32,1,2,256,128,16,4,1,512,32,128,2,4,64,256,1,32,8,16,64,2,128,32,8,16,64,4,128,32,8,256,1,512,2,4,128,256,32,1,16,64,128,8,256,1,4,512,16,64,2,1,256,128,512,4,8,2,64,32,256,16,4,8,64,512,32,1,128,256,64,4,8,512,128,32,2,16,256,8,64,1,512,16,32,2,4,64,512,128,1,8,16,256,512,2,32,64,128,256,4,16,8,512,32,2,256,128,8,16,32,512,1,128,8,2,16,512,64,32,4,256,8,512,2,64,128,256,16,512,32,64,8,256,128,2,512,16,1,256,32,4,512,128,64,16,32,256,8,512,128,16,64,1,256,512,128,16,4,32,256,512,2,1].

?- runMain_N3([32|R],240).
R = [64,128,1,2,4,8,16,32,1,2,4,8,64,16,1,2,4,128,32,8,1,2,64,128,16,4,1,8,256,2,16,4,1,512,8,2,16,4,128,32,1,64,8,4,128,2,256,1,8,32,4,512,2,1,64,8,256,4,2,32,1,64,16,4,256,2,32,64,1,512,4,8,128,16,32,1,2,256,128,16,4,1,512,32,128,2,4,64,256,1,32,8,16,64,2,128,32,8,16,64,4,128,32,8,256,1,512,2,4,128,256,32,1,16,64,128,8,256,1,4,512,16,64,2,1,256,128,512,4,8,2,64,32,256,16,4,8,64,512,32,1,128,256,64,4,8,512,128,32,2,16,256,8,64,1,512,16,32,2,4,64,512,128,1,8,16,256,512,2,32,64,128,256,4,16,8,512,32,2,256,128,8,16,32,512,1,128,8,2,16,512,64,32,4,256,8,512,2,64,128,256,16,512,32,64,8,256,128,2,512,16,1,256,32,4,512,128,64,16,32,256,8,512,128,16,64,1,256,512,128,16,4,32,256,512,2,1,64,128].

?- runMain_N3([32|R],243).
^Z
[1]+  Stopped                 swipl rules.pl
colman@ubuntu:~/gilad_gil/iEEEHighScore$ gf
gf: command not found
colman@ubuntu:~/gilad_gil/iEEEHighScore$ swipl rules.pl 
Welcome to SWI-Prolog (threaded, 64 bits, version 8.1.10-59-g09a7d55)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

    CMake built from "/home/colman/gilad_gil/swipl-devel/build"

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- halt.
colman@ubuntu:~/gilad_gil/iEEEHighScore$ fg
swipl rules.pl
^CAction (h for help) ? exit (status 4)
colman@ubuntu:~/gilad_gil/iEEEHighScore$ 
colman@ubuntu:~/gilad_gil/iEEEHighScore$ swipl rules.pl 
Welcome to SWI-Prolog (threaded, 64 bits, version 8.1.10-59-g09a7d55)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

    CMake built from "/home/colman/gilad_gil/swipl-devel/build"

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- set_prolog_flag(answer_write_options,[max_depth(0)]).
true.

?- runMain_N3([32|R],242).
^CAction (h for help) ? exit (status 4)
colman@ubuntu:~/gilad_gil/iEEEHighScore$ swipl rules.pl 
Welcome to SWI-Prolog (threaded, 64 bits, version 8.1.10-59-g09a7d55)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

    CMake built from "/home/colman/gilad_gil/swipl-devel/build"

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- set_prolog_flag(answer_write_options,[max_depth(0)]).
true.

?- runMain_N3([32|R],243).
^Z
[1]+  Stopped                 swipl rules.pl
colman@ubuntu:~/gilad_gil/iEEEHighScore$ fg
swipl rules.pl
^Z
[1]+  Stopped                 swipl rules.pl
colman@ubuntu:~/gilad_gil/iEEEHighScore$ packet_write_wait: Connection to 193.106.55.89 port 2289: Broken pipe
h-MBP-sl-Gilad:~ GiladanoN$ ssh -lcolman 193.106.55.89 -p 2289
colman@193.106.55.89's password: 
Welcome to Ubuntu 16.04.4 LTS (GNU/Linux 4.4.0-116-generic ppc64le)

 * Documentation:  https://help.ubuntu.com
 * Management:     https://landscape.canonical.com
 * Support:        https://ubuntu.com/advantage
New release '18.04.2 LTS' available.
Run 'do-release-upgrade' to upgrade to it.

Last login: Thu Aug  8 19:08:57 2019 from 213.57.185.155
colman@ubuntu:~$ cd gilad_gil/iEEEHighScore/prolog/
colman@ubuntu:~/gilad_gil/iEEEHighScore/prolog$ swipl main_guess5over.pl 
Welcome to SWI-Prolog (threaded, 64 bits, version 8.1.10-59-g09a7d55)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

    CMake built from "/home/colman/gilad_gil/swipl-devel/build"

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- [user].
|: myMain(Guess,Depth,Seq,Size) :-mainMulti_Guess5Over(Seq,Size,Guess,Depth).
|: ^D% user://1 compiled 0.00 sec, 1 clauses
true.

?- concatTo(Guess,[4,256,128,1,2,8,4,16,32,1,2,8,4,64,16,1,2,8,128,32,4,1,2,64,128,8,4,1,16,256,2,8,4,1,512,16,2,8,4,128,256,1,16,2,32,64,4,8,1,256,32,2,4,8,512,64,1,2,4,256,512,8,1,2,32,64,128,4,1,16,32,64,8,2,128,16,32,1,8,256,64,2,4,16,128,1,512,2,4,32,16,128,8,64,1,32,512,2,16,8,64,256,1,128,2,32,512,4,64,1,16,256,2,512,4,64,16,8,32,256,2,64,1,512,16,8,32,4,256,64,1,128,16,32,256,2,4,64,128,512,1,8,16,256,128,2,64,8,512,32,4,1,16,256,512,32,2,8,128,256,512,1,4,32,128,256,2,64,512,16,32,4,128,64,8,16,256,4,128,2,512,8,16,256,32,128, 4,8,512,16,256,64],[4]), myMain(Guess,3,Seq,246).
false.

?- 
|    
|    
|    
|    .

ERROR: Stream user_input:21:1 Syntax error: Unexpected end of clause
?- myMain([4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32],3,Seq,240).
^CAction (h for help) ? exit (status 4)
colman@ubuntu:~/gilad_gil/iEEEHighScore/prolog$ 
colman@ubuntu:~/gilad_gil/iEEEHighScore/prolog$ 
colman@ubuntu:~/gilad_gil/iEEEHighScore/prolog$ swipl main_guess5over.pl 
Welcome to SWI-Prolog (threaded, 64 bits, version 8.1.10-59-g09a7d55)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

    CMake built from "/home/colman/gilad_gil/swipl-devel/build"

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- [user].                                                                      |: myMain(Guess,Depth,Seq,Size) :-mainMulti_Guess5Over(Seq,Size,Guess,Depth).
|: ^D% user://1 compiled 0.00 sec, 1 clauses
true.

?- myMain([4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32],3,Seq,230).
Seq = [4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32,256,64,2,512,1,128,16,8,256,512,64,4,16,128,32,512,1,64,16,256,32,4,512,64,128,256,16,4,512,2,128,32,64,16,512,2,256,128,32,8,512,64,256,128,32,4,512,8,64,128] .

?- myMain([4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32],3,Seq,232).
Seq = [4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32,256,512,1,16,64,32,256,4,128,512,1,32,64,256,8,4,512,128,32,2,64,16,512,8,128,32,256,2,64,512,1,128,16,8,256,512,64,32,4,128,16,512,64,256,4,128,16,512,2,64,256,4] .

?- myMain([4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32],3,Seq,235).
Seq = [4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32,512,8,4,64,256,32,16,1,512,64,128,2,32,256,512,64,4,16,128,256,512,64,32,16,128,256,1,512,32,64,128,4,256,512,2,64,16,32,128,4,512,2,16,256,128,8,512,64,16,256,1,8,128,512,16] .

?- myMain([4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32],3,Seq,238).
Seq = [4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32,512,64,8,256,16,1,128,512,2,64,16,32,128,4,512,1,256,64,32,8,4,512,128,256,16,64,4,512,128,32,2,64,256,512,1,16,32,64,256,128,4,512,2,16,256,128,8,512,64,4,256,32,16,512,128,8,1,256] .

?- myMain([4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32],3,Seq,239).
Seq = [4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32,512,64,4,256,16,128,512,1,64,32,16,256,4,512,2,128,16,256,8,512,64,4,128,16,32,512,256,1,128,8,16,512,64,2,256,32,128,8,512,64,256,32,128,4,512,1,256,64,32,8,4,512,128,256,64,16,32,512,2] .

?- myMain([4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32],4,Seq,239).
Seq = [4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32,512,64,256,8,16,1,128,512,2,64,16,32,128,4,512,2,16,256,128,8,512,32,64,4,128,256,16,512,1,32,64,256,8,4,512,128,32,256,16,64,512,128,1,32,256,16,64,4,512,128,256,2,32,64,512,4,256,1,128] .

?- myMain([4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32],4,Seq,240).
Seq = [4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32,512,64,256,8,16,1,128,512,2,64,32,16,128,4,512,256,1,64,16,32,512,256,128,4,64,32,512,8,128,16,256,2,512,4,64,32,256,16,128,1,512,64,32,2,256,128,512,4,8,64,256,32,1,512,128,4,64,16,256,512] .

?- myMain([4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32],5,Seq,240).
Seq = [4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32,256,64,2,512,16,128,4,32,64,512,8,256,128,32,2,512,64,1,256,16,8,128,512,64,32,256,4,128,512,1,64,32,16,256,4,512,2,64,32,16,128,512,256,4,64,16,128,512,1,32,256,64,8,4,512,128,256,2,16,8] .

?- myMain([4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32],4,Seq,241).
Seq = [4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32,512,64,256,8,16,1,128,512,2,64,32,16,128,4,512,256,1,64,16,32,512,256,128,4,64,32,512,8,128,16,256,2,512,4,64,32,256,16,128,1,512,64,32,2,256,128,512,4,8,64,256,32,1,512,128,4,64,16,256,512,2] .

?- myMain([4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32],4,Seq,242).
Seq = [4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32,512,4,8,64,256,32,1,512,128,4,256,16,64,512,128,32,2,256,64,512,16,1,128,8,256,512,32,64,4,128,256,512,32,16,64,2,128,512,1,16,256,32,128,64,512,8,256,16,128,2,512,4,256,16,32,64,1,512,128,4,2,32] .

?- myMain([4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32],5,Seq,243).
Seq = [4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32,512,64,256,16,8,1,128,512,256,16,32,1,64,512,2,256,16,128,8,512,64,256,4,32,128,512,2,64,16,32,128,4,512,1,256,64,32,8,4,512,128,256,2,32,64,512,4,128,256,16,64,512,1,128,32,256,16,64,4,512,128,1,2] .

?- myMain([4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32],5,Seq,244).
^Z
[1]+  Stopped                 swipl main_guess5over.pl
colman@ubuntu:~/gilad_gil/iEEEHighScore/prolog$ fg
swipl main_guess5over.pl
Seq = [4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32,512,64,256,16,8,1,128,512,256,16,32,1,64,512,2,256,16,128,8,512,64,256,4,32,128,512,2,64,16,32,128,4,512,1,256,64,32,8,4,512,128,256,2,32,64,512,4,128,256,16,64,512,1,128,32,256,16,64,4,512,128,1,2,16] .

?-                                                                              |    
|    .

ERROR: Stream user_input:52:1 Syntax error: Unexpected end of clause
?- myMain([4,1,2,8,16,32,4,1,2,8,64,16,4,1,2,128,8,16,4,1,256,2,8,16,4,512,1,2,8,32,64,4,1,2,128,32,8,4,1,256,64,2,8,4,128,256,1,2,8,512,16,32,1,2,64,128,8,16,1,32,64,4,128,2,16,32,1,256,4,2,512,8,32,64,1,128,16,2,256,4,32,8,16,64,2,256,1,32,8,128,512,2,1,32,256,128,4,2,64,512,1,8,4,128,64,16,1,256,4,128,64,8,32,2,256,16,64,4,8,512,2,128,16,32,8,4,512,1,256,16,8,32,64,128,256,1,2,512,16,64,4,32,2,256,512,8,16,4,128,256,32,8,16,512,64,1,4,32,256,512,8,1,64,128,256,512,2,8,64,128,256,16,2,32,512,4,1,16,128,32],5,Seq,245).
false.

?- halt.
colman@ubuntu:~/gilad_gil/iEEEHighScore/prolog$ swipl main_guess5over.pl 
Welcome to SWI-Prolog (threaded, 64 bits, version 8.1.10-59-g09a7d55)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

    CMake built from "/home/colman/gilad_gil/swipl-devel/build"

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- [user].
|: myMain(Guess,Depth,Seq,Size) :-mainMulti_Guess5Over(Seq,Size,Guess,Depth).
|: ^D% user://1 compiled 0.00 sec, 1 clauses
true.

?- myMain([128,8],2,Seq,240).
Seq = [128,8,512,1,2,4,16,8,32,1,2,4,16,64,8,1,2,4,128,16,8,1,2,256,4,16,8,1,512,2,32,4,8,64,1,128,2,4,32,8,256,1,2,64,4,32,16,1,128,2,64,32,4,256,1,2,128,8,32,16,1,64,2,256,32,8,16,1,512,64,2,4,8,128,256,1,16,2,32,512,4,64,1,8,256,16,512,2,1,128,32,256,4,2,16,64,128,8,1,32,4,512,16,8,2,32,64,1,512,8,2,256,4,64,128,1,16,32,256,4,8,64,16,32,128,2,4,512,1,256,8,32,64,16,512,1,4,128,32,64,8,2,512,16,128,4,8,32,256,512,2,1,64,128,256,8,2,512,64,128,4,8,16,256,512,32,1,64,128,256,16,2,4,512,64,256,8,16,128,32,512,1,256,4,16,64,32,128,256,2,16,512,32,64,4,256,128,512,2,32,64,256,16,1,512,128,8,256,16,2,64,512,128,256,16,4,64,512,8,32,128,256,64,512,1,4,128,256,16,32,512,4,128,8,256,64,512,32,16,128] .

?- myMain([128,8],2,Seq,241).
Seq = [128,8,512,1,2,4,16,8,32,1,2,4,16,64,8,1,2,4,128,16,8,1,2,256,4,16,8,1,512,2,32,4,8,64,1,128,2,4,32,8,256,1,2,64,4,32,16,1,128,2,64,32,4,256,1,2,128,8,32,16,1,64,2,256,32,8,16,1,512,64,2,4,8,128,256,1,16,2,32,512,4,64,1,8,256,16,512,2,1,128,32,256,4,2,16,64,128,8,1,32,4,512,16,8,2,32,64,1,512,8,2,256,4,64,128,1,16,32,256,4,8,64,16,32,128,2,4,512,1,256,8,32,64,16,512,1,4,128,32,64,8,2,512,16,128,4,8,32,256,512,2,1,64,128,256,8,2,512,64,128,4,8,16,256,512,32,1,64,128,256,16,2,4,512,64,256,8,16,128,32,512,1,256,4,16,64,32,128,256,2,16,512,32,64,4,256,128,512,2,32,64,256,16,1,512,128,8,256,16,2,64,512,128,256,16,4,64,512,8,32,128,256,64,512,1,4,128,256,16,32,512,4,128,8,256,64,512,32,16,128,2] .

?- myMain([128,8],2,Seq,242).

^CAction (h for help) ? exit (status 4)
colman@ubuntu:~/gilad_gil/iEEEHighScore/prolog$ swipl main_guess5over.pl 
Welcome to SWI-Prolog (threaded, 64 bits, version 8.1.10-59-g09a7d55)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

    CMake built from "/home/colman/gilad_gil/swipl-devel/build"

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- [user].
|: myMain(Guess,Depth,Seq,Size) :-mainMulti_Guess5Over(Seq,Size,Guess,Depth).
|: ^D% user://1 compiled 0.00 sec, 1 clauses
true.

?- 
|    .

ERROR: Stream user_input:15:1 Syntax error: Unexpected end of clause
?- myMain([128,32],3,Seq,240).
Seq = [128,32,2,1,512,4,8,16,2,1,32,4,8,16,2,64,1,4,8,16,128,2,1,4,8,256,16,2,1,4,512,64,8,2,1,32,128,4,8,2,64,32,16,1,4,128,64,2,16,1,256,32,4,2,8,512,128,1,4,2,256,64,8,1,4,32,256,64,2,1,128,8,256,4,2,512,16,32,1,8,64,128,4,16,32,2,64,128,1,512,4,16,32,8,64,128,2,16,256,1,512,4,8,32,64,128,256,1,4,16,64,512,2,1,32,8,256,16,2,64,32,512,4,1,128,256,32,2,4,512,128,16,8,1,64,256,32,16,4,8,128,256,32,1,16,512,64,8,2,32,256,128,16,4,64,512,8,128,1,256,16,64,512,2,128,4,256,16,512,8,2,32,128,16,1,512,2,8,256,64,128,1,512,16,256,8,32,64,512,16,128,8,2,256,512,32,64,128,2,256,512,1,32,128,64,4,2,256,16,32,512,128,4,8,256,64,16,512,32,4,256,8,64,512,128,32,4,256,64,512,1,8,32,128,16,256,64,512,4,2] .

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4,256,64,16,32,512,128,256,64,16,2,512,4,128,32,16,256,64,1,128,512,4,32,256,64,8,512,128,1,4,256,16,512,128,8,32,4,256,512,2,128,8,1,32,512,256,16,4,8,128,512,256,1],2,Seq,240).
false.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4,256,64,16,32,512,128,256,64,16,2,512,4,128,32,16,256,64,1,128,512,4,32,256,64,8,512,128,1,4,256,16,512,128,8,32,4,256,512,2,128,8,1,32,512,256,16,4,8,128,512,256,1],2,Seq,244).
false.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4,256,64,16,32,512,128,256,64,16,2,512,4,128,32,16,256,64,1,128,512,4,32,256,64,8,512,128,1,4,256,16,512,128,8,32,4,256,512,2,128,8,1,32,512,256,16,4,8,128,512,256,1],2,Seq,246).
false.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4,256,64,16,32,512,128,256,64,16,2,512,4,128,32,16,256,64,1,128,512,4,32,256,64,8,512,128,1,4,256,16,512,128,8,32,4,256,512,2,128,8,1,32,512,256,16,4,8,128,512,256,1],2,Seq,247).
false.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4,256,64,16,32,512,128,256,64,16,2,512,4,128,32,16,256,64,1,128,512,4,32,256,64,8,512,128,1,4,256,16,512,128,8,32,4,256,512,2,128,8,1,32,512,256,16,4,8,128,512,256,1],2,Seq,248).
false.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4,256,64,16,32,512,128,256,64,16,2,512,4,128,32,16,256,64,1,128,512,4,32,256,64,8,512,128,1,4,256,16,512,128,8,32,4,256,512,2,128,8,1,32,512,256,16,4,8],2,Seq,245).
false.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4,256,64,16,32,512,128,256,64,16,2,512,4,128,32,16,256,64,1,128,512,4,32,256,64,8,512,128,1,4,256,16,512,128,8,32,4,256,512],2,Seq,245).
false.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4,256,64,16,32,512,128,256,64,16,2,512,4,128,32,16,256,64,1],2,Seq,245). 
false.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4,256,64,16],2,Seq,245).
false.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8],2,Seq,245). 
^CAction (h for help) ? exit (status 4)
colman@ubuntu:~/gilad_gil/iEEEHighScore/prolog$ 
colman@ubuntu:~/gilad_gil/iEEEHighScore/prolog$ swipl main_guess5over.pl 
Welcome to SWI-Prolog (threaded, 64 bits, version 8.1.10-59-g09a7d55)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

    CMake built from "/home/colman/gilad_gil/swipl-devel/build"

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- [user].
|: myMain(Guess,Depth,Seq,Size) :-mainMulti_Guess5Over(Seq,Size,Guess,Depth).   |: ^D% user://1 compiled 0.01 sec, 1 clauses
true.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4,256,64,16],2,Seq,243).
Seq = [128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4,256,64,16,32,512,128,256,64,16,2,512,4,128,32,16,256,64,1,128,512,4,32,256,64,8,512,128,1,4,256,16,512,128,8,32,4,256,512,2,128,8,1,32,512,256,16,4,8,128,512,256,1,16,64,8] .

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4,256,64,16],2,Seq,243).
Seq = [128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4,256,64,16,32,512,128,256,64,16,2,512,4,128,32,16,256,64,1,128,512,4,32,256,64,8,512,128,1,4,256,16,512,128,8,32,4,256,512,2,128,8,1,32,512,256,16,4,8,128,512,256,1,16,64,8] .

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4,256,64,16],2,Seq,244).
false.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4,256],2,Seq,244). 
false.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32,128,2,8,512,4],2,Seq,244).
false.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,3],2,Seq,244).
false.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,4,512,64,32,128,8,256,1,64,512,2,8,16,256,128,1,32,512,2,256,8,64,128,16,512,2,256,32,64,16,8,512,256,32],2,Seq,244).
false.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1],2,Seq,244). 
^Z
[1]+  Stopped                 swipl main_guess5over.pl
colman@ubuntu:~/gilad_gil/iEEEHighScore/prolog$ fg
swipl main_guess5over.pl
Seq = [128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1,128,8,64,512,2,1,128,8,32,512,2,256,16,8,128,4,512,1,32,256,16,4,64,512,2,128,16,256,64,32,2,512,128,1,256,16,4,512,128,32,8,16,256,64,1,128,512,32,256,64,4,8,512,128,2,256,64,8,512,16,32,256,128,4,512,1,64,256,16,32,512,4,8,256,128,32,2,512,4,256,8,16,64,128,512,256,8,32,64,128,512,4,256,2,1] 
Unknown action: (h for help)
Action? 
Unknown action: [ (h for help)
Action? 
Unknown action: A (h for help)
Action? ;
false.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1],3,Seq,248).
^Z
[1]+  Stopped                 swipl main_guess5over.pl
colman@ubuntu:~/gilad_gil/iEEEHighScore/prolog$ fg
swipl main_guess5over.pl
^CAction (h for help) ? exit (status 4)
colman@ubuntu:~/gilad_gil/iEEEHighScore/prolog$ 
colman@ubuntu:~/gilad_gil/iEEEHighScore/prolog$ swipl main_guess5over.pl 
Welcome to SWI-Prolog (threaded, 64 bits, version 8.1.10-59-g09a7d55)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

    CMake built from "/home/colman/gilad_gil/swipl-devel/build"

For online help and background, visit http://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- [user].
|: myMain(Guess,Depth,Seq,Size) :-mainMulti_Guess5Over(Seq,Size,Guess,Depth).
|: ^D% user://1 compiled 0.00 sec, 1 clauses
true.

?- myMain([128,32,1,2,4,8,16,32,1,2,4,64,8,16,1,2,128,4,8,16,1,256,2,4,8,16,512,1,2,4,32,256,8,1,2,64,32,16,4,1,128,64,2,8,4,32,128,1,64,2,16,4,128,32,8,64,1,4,128,256,2,8,1,512,4,32,16,2,256,1,64,4,8,512,2,32,1,16,128,8,64,2,32,16,128,8,64,4,256,2,16,128,1,512,4,2,64,32,128,256,1,2,64,32,512,8,1,16,64,32,128,4,256,1,8,512,16,128,2,32,256,4,64,1,16,512,2,256,4,64,128,16,512,1,32,64,256,8,2,16,32,512,64,4,8,16,32,256,1],5,Seq,248).
^Z
[1]+  Stopped                 swipl main_guess5over.pl
colman@ubuntu:~/gilad_gil/iEEEHighScore/prolog$ fg
swipl main_guess5over.pl
^Z
[1]+  Stopped                 swipl main_guess5over.pl
colman@ubuntu:~/gilad_gil/iEEEHighScore/prolog$ packet_write_wait: Connection to 193.106.55.89 port 2289: Broken pipe
h-MBP-sl-Gilad:~ GiladanoN$ 
